# **Missing Values**

In [35]:
import numpy as np
import pandas as pd

In [36]:
data = {
    'A':[1,2,3,4,5],
    'B':[11,12,13,14,15],
    'C':[11,12,np.nan,np.nan,17],
    'D':[6,7,np.nan,8,9]
}

In [37]:
df = pd.DataFrame(data)
df

   A   B     C    D
0  1  11  11.0  6.0
1  2  12  12.0  7.0
2  3  13   NaN  NaN
3  4  14   NaN  8.0
4  5  15  17.0  9.0

In [38]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False  False
2  False  False   True   True
3  False  False   True  False
4  False  False  False  False

In [39]:
df.isna().count()

A    5
B    5
C    5
D    5
dtype: int64

In [40]:
df.isna().sum()

A    0
B    0
C    2
D    1
dtype: int64

In [41]:
df.isna().sum(axis = 1)

0    0
1    0
2    2
3    1
4    0
dtype: int64

In [42]:
df.isna().any()

A    False
B    False
C     True
D     True
dtype: bool

In [43]:
df.isna().any(axis=1)

0    False
1    False
2     True
3     True
4    False
dtype: bool

- Removing Missing Values

In [44]:
df

   A   B     C    D
0  1  11  11.0  6.0
1  2  12  12.0  7.0
2  3  13   NaN  NaN
3  4  14   NaN  8.0
4  5  15  17.0  9.0

In [45]:
df.dropna()    #removes all the rows with null values

   A   B     C    D
0  1  11  11.0  6.0
1  2  12  12.0  7.0
4  5  15  17.0  9.0

In [46]:
df.dropna(thresh=3)  #removes all the rows which have less than 3 non-NaN values

   A   B     C    D
0  1  11  11.0  6.0
1  2  12  12.0  7.0
3  4  14   NaN  8.0
4  5  15  17.0  9.0

- Filling The Missing values

In [47]:
df

   A   B     C    D
0  1  11  11.0  6.0
1  2  12  12.0  7.0
2  3  13   NaN  NaN
3  4  14   NaN  8.0
4  5  15  17.0  9.0

In [48]:
df.fillna(0)

   A   B     C    D
0  1  11  11.0  6.0
1  2  12  12.0  7.0
2  3  13   0.0  0.0
3  4  14   0.0  8.0
4  5  15  17.0  9.0

*To frreze these values, Implace=True*

In [49]:
values = {
    'A':00,
    'B':100,
    'C':200,
    'D':300
}
df.fillna(value=values)

   A   B      C      D
0  1  11   11.0    6.0
1  2  12   12.0    7.0
2  3  13  200.0  300.0
3  4  14  200.0    8.0
4  5  15   17.0    9.0

In [50]:
df.fillna(df.mean())

   A   B          C    D
0  1  11  11.000000  6.0
1  2  12  12.000000  7.0
2  3  13  13.333333  7.5
3  4  14  13.333333  8.0
4  5  15  17.000000  9.0